doc/slides/slide_copie.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Copie d&rsquo;objets</title>
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../stylesheets/styles.css">
                 <link rel="stylesheet" href="../stylesheets/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
</a><a href="slide_compilation.html">Compilation & Directives de préprocesseur </a><a href="slide_pointeur.html">Pointeurs, Références & Allocation Dynamique de Mémoire </a><a href="slide_specificite_c++.html">Spécificités du C++ (indépendantes de la POO) </a><a href="slide_struct_class.html">Structures & Classes </a><a href="slide_encapsulation.html">Encapsulation des données </a><a href="slide_constructeur.html">Constructeur & Destructeur de classe </a><a href="slide_copie.html">Copie d'objets </a><a href="slide_amitie_surcharge.html">Amitié & Surcharge d'opérateur </a><a href="slide_heritage_1.html">Héritage (Partie 1) </a><a href="slide_heritage_2.html">Héritage (Partie 2) </a><a href="slide_template.html">Patrons de fonctions et de classes </a><a href="slide_STL.html">Introduction à la librairie standard </a>
                     <hr/>
                     <a href="../../index.html">Retour menu principal</a>
</div>
<div id="content">
<h1 class="title">Copie d&rsquo;objets</h1><hr/>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">Rappel : passage par valeur, par référence</h2>
<div class="outline-text-2" id="text-orgheadline3">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1">Passage par valeur</h3>
<div class="outline-text-3" id="text-orgheadline1">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">void</span> <span class="org-function-name">f</span>(<span class="org-type">int</span> <span class="org-variable-name">i</span>)
{
  i = 10;
  cout &lt;&lt; <span class="org-string">"f : "</span> &lt;&lt; i &lt;&lt; endl;
}

<span class="org-type">int</span> <span class="org-function-name">main</span>()
{
  <span class="org-type">int</span> <span class="org-variable-name">e</span> = 0;
  f(e);
  cout &lt;&lt; <span class="org-string">"main : "</span> &lt;&lt; e &lt;&lt; endl;
  <span class="org-keyword">return</span> EXIT_SUCCESS;
}
</pre>
</div>

<div class="CBOX">
<p>
f : 10<br  />
main : 0
</p>

</div>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">Passage par référence</h3>
<div class="outline-text-3" id="text-orgheadline2">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">void</span> <span class="org-function-name">g</span>(<span class="org-type">int</span>&amp; <span class="org-variable-name">i</span>)
{
  i = 10;
  cout &lt;&lt; <span class="org-string">"g : "</span> &lt;&lt; i &lt;&lt; endl;
}

<span class="org-type">int</span> <span class="org-function-name">main</span>()
{
  <span class="org-type">int</span> <span class="org-variable-name">e</span> = 0;
  g(e);
  cout &lt;&lt; <span class="org-string">"main : "</span> &lt;&lt; e &lt;&lt; endl;
  <span class="org-keyword">return</span> EXIT_SUCCESS;
}
</pre>
</div>

<div class="CBOX">
<p>
g : 10<br  />
main : 10
</p>

</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6">Passage d&rsquo;objets par valeur, par référence</h2>
<div class="outline-text-2" id="text-orgheadline6">
</div><div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">Passage par valeur</h3>
<div class="outline-text-3" id="text-orgheadline4">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">void</span> <span class="org-function-name">f</span>(<span class="org-type">Complexe</span> <span class="org-variable-name">z</span>)
{
  z.set_real_imag(2, 3);
  cout &lt;&lt; <span class="org-string">"f : "</span>;
  z.affiche();
}

<span class="org-type">int</span> <span class="org-function-name">main</span>()
{
  <span class="org-type">Complexe</span> <span class="org-variable-name">p</span>(1, 0.5);
  f(p);
  cout &lt;&lt; <span class="org-string">"main : "</span>;
  p.affiche();
  <span class="org-keyword">return</span> EXIT_SUCCESS;
}
</pre>
</div>

<div class="CBOX">
<p>
f : (2 + 3i)<br  />
main : (1 + 0.5i)
</p>

</div>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5">Passage par référence</h3>
<div class="outline-text-3" id="text-orgheadline5">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">void</span> <span class="org-function-name">g</span>(<span class="org-type">Complexe</span>&amp; <span class="org-variable-name">z</span>)
{
  z.set_real_imag(2, 3);
  cout &lt;&lt; <span class="org-string">"g : "</span>;
  z.affiche();
}

<span class="org-type">int</span> <span class="org-function-name">main</span>()
{
  <span class="org-type">Complexe</span> <span class="org-variable-name">p</span>(1, 0.5);
  g(p);
  cout &lt;&lt; <span class="org-string">"main : "</span>;
  p.affiche();
  <span class="org-keyword">return</span> EXIT_SUCCESS;
}
</pre>
</div>

<div class="CBOX">
<p>
g : (2 + 3i)<br  />
main : (2 + 3i)
</p>

</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7">Passage d&rsquo;objets par valeur, par référence</h2>
<div class="outline-text-2" id="text-orgheadline7">
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8">Passage par valeur</h3>
<div class="outline-text-3" id="text-orgheadline8">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">void</span> <span class="org-function-name">f</span>(<span class="org-type">Complexe</span> <span class="org-variable-name">z</span>)
{
  cout &lt;&lt; <span class="org-string">"Le complexe vaut "</span>;
  z.affiche();
}

<span class="org-type">int</span> <span class="org-function-name">main</span>()
{
  <span class="org-type">Complexe</span> <span class="org-variable-name">p</span>(1, 0.5);
  f(p);
  <span class="org-keyword">return</span> EXIT_SUCCESS;
}
</pre>
</div>

<div class="CBOX">
<p>
L&rsquo;objet est copié
</p>

</div>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9">Passage par référence constante</h3>
<div class="outline-text-3" id="text-orgheadline9">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">void</span> <span class="org-function-name">g</span>(<span class="org-keyword">const</span> <span class="org-type">Complexe</span>&amp; <span class="org-variable-name">z</span>)
{
  cout &lt;&lt; <span class="org-string">"Le complexe vaut "</span>;
  z.affiche();
}

<span class="org-type">int</span> <span class="org-function-name">main</span>()
{
  <span class="org-type">Complexe</span> <span class="org-variable-name">p</span>(1, 0.5);
  g(p);
  <span class="org-keyword">return</span> EXIT_SUCCESS;
}
</pre>
</div>

<div class="CBOX">
<p>
Une copie inutile est évitée
</p>

</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10">Objets constants</h2>
<div class="outline-text-2" id="text-orgheadline10">
<p>
Le mot-clé <code>const</code> interdit la modification de l&rsquo;objet auquel il s&rsquo;applique.
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">const</span> <span class="org-type">int</span> <span class="org-variable-name">i</span> = 42;
i = 3;  <span class="org-comment-delimiter">// </span><span class="org-comment">erreur de compilation</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">void</span> <span class="org-function-name">f</span>(<span class="org-keyword">const</span> <span class="org-type">Complexe</span>&amp; <span class="org-variable-name">z</span>)
{
  z.affiche();  <span class="org-comment-delimiter">// </span><span class="org-comment">possible</span>
  z.set_real_imag(1, 2);  <span class="org-comment-delimiter">// </span><span class="org-comment">impossible</span>
}
</pre>
</div>

<p>
Le compilateur doit savoir quelles méthodes modifient l&rsquo;objet.
</p>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-2">
<h2 id="orgheadline11">Méthodes et &ldquo;<code>const</code>-correctness&rdquo;</h2>
<div class="outline-text-2" id="text-orgheadline11">
<p>
Le prototype d&rsquo;une méthode doit se terminer par <code>const</code> si celle-ci ne
modifie pas l&rsquo;objet :
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">Complexe</span>
{
<span class="org-keyword">public</span>:
  ...
  <span class="org-type">void</span> affiche() <span class="org-keyword">const</span>;
  <span class="org-type">void</span> <span class="org-function-name">set_real_imag</span>(<span class="org-type">double</span> <span class="org-variable-name">real</span>, <span class="org-type">double</span> <span class="org-variable-name">imag</span>);
  ...
};
</pre>
</div>

<ul class="org-ul">
<li>Par défaut les méthodes peuvent modifier l&rsquo;objet.</li>

<li>En cas d&rsquo;oubli de <code>const</code>, la méthode ne peut donc pas être utilisée sur des
objets constants.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12">Copier un objet</h2>
<div class="outline-text-2" id="text-orgheadline12">
<p>
La copie est la création d&rsquo;un nouvel objet ayant la même valeur qu&rsquo;un objet
existant.
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">Point</span>
{
<span class="org-keyword">public</span>:
  ...
  Point(<span class="org-keyword">const</span> <span class="org-type">Point</span>&amp; <span class="org-variable-name">other</span>);
  ...
<span class="org-keyword">private</span>:
  <span class="org-type">int</span> <span class="org-variable-name">m_x</span>;
  <span class="org-type">int</span> <span class="org-variable-name">m_y</span>;
};
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13">Copier un objet : le constructeur de copie</h2>
<div class="outline-text-2" id="text-orgheadline13">
<p>
Exemple de définition d&rsquo;un constructeur de copie :
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#include</span> <span class="org-string">"Point.h"</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-keyword">using</span> <span class="org-keyword">namespace</span> <span class="org-constant">std</span>;

<span class="org-constant">Point</span>::<span class="org-function-name">Point</span>(<span class="org-keyword">const</span> <span class="org-type">Point</span>&amp; <span class="org-variable-name">other</span>)
  : m_x(other.m_x), m_y(other.m_y)
{
  cout &lt;&lt; <span class="org-string">"copie de Point"</span> &lt;&lt; endl;
}
</pre>
</div>

<ul class="org-ul">
<li>En l&rsquo;absence de constructeur de copie le compilateur en génère un
automatiquement : il copie une à une les valeurs des membres.</li>

<li>Lorsqu&rsquo;une classe gère de la mémoire allouée dynamiquement, un constructeur de
copie est donc <b>indispensable</b>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14">Exemple de copie inévitable</h2>
<div class="outline-text-2" id="text-orgheadline14">
<p>
Parfois on ne peut pas éviter de copier un objet :
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">Complexe</span> <span class="org-function-name">f</span>();

<span class="org-type">int</span> <span class="org-function-name">main</span>()
{
  <span class="org-type">Complexe</span> <span class="org-variable-name">z</span> = f();
  z.affiche();
  <span class="org-keyword">return</span> EXIT_SUCCESS;
}
</pre>
</div>

<p>
La valeur de retour de <code>f</code> est copiée dans le nouvel objet <code>z</code>.
</p>
</div>
</div>

<div id="outline-container-orgheadline15" class="outline-2">
<h2 id="orgheadline15">Exemple de copie évitable</h2>
<div class="outline-text-2" id="text-orgheadline15">
<p>
Mais on peut souvent éviter des copies inutiles :
</p>
</div>

<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16">Copie inutile</h3>
<div class="outline-text-3" id="text-orgheadline16">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">Complexe</span> <span class="org-function-name">f</span>()
{
  <span class="org-type">Complexe</span> <span class="org-variable-name">z</span>(1, 2);
  <span class="org-keyword">return</span> z;
}
</pre>
</div>

<div class="CBOX">
<p>
La variable locale <code>z</code> est copiée dans un objet anonyme retourné par la
fonction.
</p>

</div>
</div>
</div>
<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17">Sans copie inutile</h3>
<div class="outline-text-3" id="text-orgheadline17">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">Complexe</span> <span class="org-function-name">f</span>()
{
  <span class="org-keyword">return</span> Complexe(1, 2);
}
</pre>
</div>

<div class="CBOX">
<p>
Il n&rsquo;y a plus de variable locale. L&rsquo;objet anonyme est construit directement.
</p>

</div>
</div>
</div>
</div>
</div>
</body>
</html>
